app/views/users/_user_display.html.erb

<% User.all.each do |user| %>
---
SELECT "users".* FROM "users"