app/controllers/articles_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
---
    def index
        @user = User.friendly.find(params[:id])

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", 1]]
---
	def show
		@article = Article.friendly.find(params[:id])

INSERT INTO "articles" ("title", "text", "user_id", "slug", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "Test Curtis"], ["text", "Testing saving article"], ["user_id", 1], ["slug", "test-curtis"], ["created_at", "2017-01-13 15:46:59.513494"], ["updated_at", "2017-01-13 15:46:59.513494"]]
---
    def create
        @article = current_user.articles.new(article_params)
        if @article.save

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", 1]]
---
    def edit
        @article = Article.friendly.find(params[:id])

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "articles" SET "text" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["text", "Testing text to be updated"], ["updated_at", "2017-01-16 21:10:46.695946"], ["id", 7]]
---
    def update
        @article = Article.friendly.find(params[:id])

        if @article.update(article_params)

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "articles" WHERE "articles"."id" = ?  [["id", 1]]
---
    def destroy
        #@article = Article.find(params[:id])
        #@article.destroy

        #redirect_to articles_path

        article = Article.friendly.find(params[:id])
        user = article.user
        article.destroy