app/controllers/comments_controller.rb

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", 2]]
INSERT INTO "comments" ("commenter", "body", "article_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["commenter", "Curtis"], ["body", "This is a comment"], ["article_id", 2], ["created_at", "2017-01-09 20:52:47.982398"], ["updated_at", "2017-01-09 20:52:47.982398"]]
---
    def create
        article = Article.friendly.find(params[:article])
        @comment = article.comments.new(comment_params)
        if @comment.save

DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 1]]
---
    def destroy
        comment = Comment.find(params[:id]).destroy