app/controllers/subscribers_controller.rb

    def create
        user = User.friendly.find(params[:user])
        subscriber = user.subscribers.new(subscriber_params)
        if subscriber.save
---
INSERT INTO "subscribers" ("email", "user_id", "created_at", "updated_at", "unsubscribe_token") VALUES (?, ?, ?, ?, ?)  [["email", "katierose89@hotmail.com"], ["user_id", 1], ["created_at", "2017-01-18 20:02:39.828933"], ["updated_at", "2017-01-18 20:02:39.828933"], ["unsubscribe_token", "D9ujUl4HoSJ4lBjnOLSmyA"]]